# ------------------------------
# Shell
# ------------------------------
brew "zsh"
brew "bash"
brew "fish"
brew "starship"


# ------------------------------
# Apps
# ------------------------------
cask "google-chrome"
cask "docker"
cask "zed"
cask "visual-studio-code"
cask "raycast"
cask "divvy"
cask "spotify"
cask "slack"
cask "cleanshot"
cask "obsidian"
cask "1password"
brew "borders"


# ------------------------------
# Coding Agent
# ------------------------------
brew "codex"
brew "claude-code"


# ------------------------------
# Git/GitHub
# ------------------------------
brew "git"
brew "gh"
brew "delta"
brew "diff-so-fancy"


# ------------------------------
# Fonts
# ------------------------------
cask "font-fira-code-nerd-font"
cask "font-iosevka"


# ------------------------------
# Development Tools
# ------------------------------
brew "thefuck"

# ------------------------------
# Replacement for X
# ------------------------------
# Replacement for `cat`
# https://github.com/sharkdp/bat
brew "bat"

# Replacement for `grep`
# https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# Replacement for fuzzy finder
# https://github.com/junegunn/fzf
brew "fzf"

# Replacement for AST-aware grep
# https://github.com/ast-grep/ast-grep
brew "ast-grep"

# Replacement for `ls`
# https://github.com/ogham/exa
brew "exa"

# Replacement for `find`
# https://github.com/sharkdp/fd
brew "fd"

# Replacement for `sed`
# https://github.com/chmln/sd
brew "sd"

# Replacement for `ps`
# https://github.com/dalance/procs
brew "procs"

# Replacement for `du -sh`
# https://github.com/sharkdp/diskus
brew "diskus"

# Replacement for `htop`
# https://github.com/ClementTsang/bottom
brew "bottom"

# Replacement for `tldr`
# https://github.com/tealdeer-rs/tealdeer
brew "tealdeer"

# Replacement for `ping`
# https://github.com/denilsonsa/prettyping
brew "prettyping"
