# Taps
tap "homebrew/bundle"

# CLI tools
brew "fish"
brew "git"
brew "gh"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "delta"
brew "bottom"
brew "procs"
brew "prettyping"

# Foundamental
cask "zoom"
cask "google-japanese-ime"
cask "raycast"
cask "divvy"
cask "spotify"
cask "deepl"
cask "slack"
cask "cleanshot"
cask "obsidian"
cask "notion-calendar"
cask "1password"
tap "FelixKratz/formulae"
brew "borders"

# Browser
cask "arc"
cask "google-chrome"

# Development
cask "visual-studio-code"
cask "cursor"
cask "windsurf"
cask "iterm2"
cask "ghostty"
cask "docker"
cask "1password-cli"
cask "figma"
brew "starship"
brew "diff-so-fancy"
brew "tealdeer"


# LLM
cask "ollama"
cask "claude"
cask "chatgpt"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-plemol-jp-hs"
