# ------------------------------
# Taps
# ------------------------------
tap "trasta298/tap"


# ------------------------------
# Shell & Prompt
# ------------------------------
brew "zsh"
brew "bash"
brew "fish"
brew "starship"
brew "zoxide"                   # Smarter cd (https://github.com/ajeetdsouza/zoxide)
brew "thefuck"                  # Auto-correct mistyped commands


# ------------------------------
# AI Coding Agents
# ------------------------------
brew "codex"
brew "claude-code"


# ------------------------------
# Version Control
# ------------------------------
brew "git"
brew "gh"
brew "delta"
brew "diff-so-fancy"


# ------------------------------
# Modern CLI Tools
# ------------------------------
# Each replaces or improves a classic Unix command.
brew "bat"                      # cat    (https://github.com/sharkdp/bat)
brew "ripgrep"                  # grep   (https://github.com/BurntSushi/ripgrep)
brew "fd"                       # find   (https://github.com/sharkdp/fd)
brew "fzf"                      # fuzzy  (https://github.com/junegunn/fzf)
brew "ast-grep"                 # AST    (https://github.com/ast-grep/ast-grep)
brew "exa"                      # ls     (https://github.com/ogham/exa)
brew "sd"                       # sed    (https://github.com/chmln/sd)
brew "procs"                    # ps     (https://github.com/dalance/procs)
brew "diskus"                   # du     (https://github.com/sharkdp/diskus)
brew "bottom"                   # htop   (https://github.com/ClementTsang/bottom)
brew "tealdeer"                 # tldr   (https://github.com/tealdeer-rs/tealdeer)
brew "prettyping"               # ping   (https://github.com/denilsonsa/prettyping)


# ------------------------------
# File Management & Media
# ------------------------------
brew "yazi"                     # Terminal file manager
brew "jq"                       # JSON processor
brew "sevenzip"                 # Archive tool
brew "ffmpeg"                   # Video/audio processing
brew "imagemagick"              # Image processing
brew "poppler"                  # PDF rendering
brew "resvg"                    # SVG rendering
brew "trasta298/tap/keifu"      # Directory tree visualizer


# ------------------------------
# macOS Desktop Apps
# ------------------------------
# Window management & system
brew "borders"
cask "raycast"
cask "divvy"
cask "cleanshot"
cask "1password"
# Development
cask "docker"
cask "zed"
cask "visual-studio-code"
# Communication & media
cask "google-chrome"
cask "slack"
cask "obsidian"
cask "spotify"


# ------------------------------
# Fonts
# ------------------------------
cask "font-fira-code-nerd-font"
cask "font-iosevka"
cask "font-symbols-only-nerd-font"
