# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# CLI tools
brew "fish"
brew "git"
brew "gh"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "exa"
brew "delta"

# Development
brew "node"
brew "python"
brew "go"

# Applications
cask "1password"
cask "1password-cli"
cask "visual-studio-code"
cask "cursor"
cask "iterm2"
cask "docker"
cask "google-chrome"
cask "slack"
cask "cleanshot"
cask "raycast"
cask "obsidian"
cask "divvy"
cask "spotify"
cask "deepl"
cask "ollama"

# Fonts
brew "font-fira-code-nerd-font"